; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 237878 2 3 4 5 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared1 - mode
	image2 - mode
	spectrograph3 - mode
	spectrograph0 - mode
	GroundStation4 - direction
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph3)
	(supports instrument2 image2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 image2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph0)
	(supports instrument5 image2)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite1 Star0)
	(have_image Phenomenon5 infrared1)
	(have_image Planet6 infrared1)
	(have_image Planet7 infrared1)
	(have_image Star8 image2)
))

)

; plan
1. (turn_to satellite1 star0 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star0)
   goals met: 1 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 5
4. (turn_to satellite0 star1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star1)
   goals met: 1 of 5
5. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 5
6. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 1 of 5
7. (turn_to satellite0 planet7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet7)
   goals met: 1 of 5
8. (turn_to satellite1 star8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star8)
   goals met: 0 of 5
9. (take_image satellite0 planet7 instrument1 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 1 of 5
10. (take_image satellite1 star8 instrument3 image2)
   added: (have_image star8 image2)
   goals met: 2 of 5
11. (turn_to satellite1 star0 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star0)
   goals met: 3 of 5
12. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 3 of 5
13. (take_image satellite0 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 4 of 5
14. (turn_to satellite0 phenomenon5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 5
15. (take_image satellite0 phenomenon5 instrument1 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 5 of 5
